query_ticket.xml

<env:Envelope
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:tns="http://autotask.net/ATWS/v1_5/"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Body>
        <tns:query xmlns="http://autotask.net/ATWS/v1_5/">
            <sXML>
                <![CDATA[<queryxml>
                    <entity>Ticket</entity>
                    <query>
                        <field>{filter_field}
                            <expression op="equals">{ticket_number}</expression>
                        </field>
                    </query>
                </queryxml>]]>
            </sXML>
        </tns:query>
    </env:Body>
</env:Envelope>
